cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
    def index
        # debugger
        @cats = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def create
        @age = Cat.find(params[:id]).age #check later

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @color = Cat.color
        @cat = Cat.find(params[:id])